#include<stdio.h>
#include"../inc/rules.h"


void print_rules(void)
{
    puts("\n____________________________________________\n");
    puts("     Правила введения действительного числа:  ");
    puts("1. Мантисса должна иметь знак - '-' or '+' ");
    puts("2. Мантисса должна иметь точку - '.' ");
    puts("3. Число должно содержать символ экспоненты - 'E' ");
    puts("4. Порядок должен иметь знак - '-' or '+' ");
    puts("5. Мантисса должна содержать в себе 30 чисел ");
    puts("6. При вводе недопустимы пробелы ");
    puts("____________________________________________\n\n");
}
